In [1]:
import numpy as np
import pandas as pd

## Datafreym (DataFrame) ma ºlumotlar tuzilmasi

In [2]:
data = {
    'Yil':        [2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
    'Aholi soni': [33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5], 
    'Temp':       [1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53]
}

In [3]:
df = pd.DataFrame(data)
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [4]:
df.shape

(8, 3)

In [5]:
df = pd.DataFrame(data, columns=['Yil', 'Temp', 'Aholi soni'])

In [6]:
df.sample()

    Yil  Temp  Aholi soni
7  2010  1.53        28.5

In [7]:
# index o'rnatish
df = pd.DataFrame(data, columns=['Yil', 'Temp', 'Aholi soni', 'GDP'], index = [21,20,19,18,17,16,15,10])

In [8]:
df

     Yil  Temp  Aholi soni  GDP
21  2021  1.54        33.9  NaN
20  2020  1.48        33.5  NaN
19  2019  1.56        32.9  NaN
18  2018  1.62        32.5  NaN
17  2017  1.65        31.9  NaN
16  2016  1.66        31.4  NaN
15  2015  1.64        30.9  NaN
10  2010  1.53        28.5  NaN

In [9]:
df.Temp

21    1.54
20    1.48
19    1.56
18    1.62
17    1.65
16    1.66
15    1.64
10    1.53
Name: Temp, dtype: float64

In [10]:
df.GDP = 0
df.sample()

     Yil  Temp  Aholi soni  GDP
20  2020  1.48        33.5    0

In [11]:
val = pd.Series([1700, 1650, 1500], index=[21,20,10])
df.GDP = val
df

     Yil  Temp  Aholi soni     GDP
21  2021  1.54        33.9  1700.0
20  2020  1.48        33.5  1650.0
19  2019  1.56        32.9     NaN
18  2018  1.62        32.5     NaN
17  2017  1.65        31.9     NaN
16  2016  1.66        31.4     NaN
15  2015  1.64        30.9     NaN
10  2010  1.53        28.5  1500.0

In [12]:
# NaN larga qiymat berish
val = [1700, 1650, 1600, 1500, 1450, 1400, 1380, 1350]
df.GDP = val
df

     Yil  Temp  Aholi soni   GDP
21  2021  1.54        33.9  1700
20  2020  1.48        33.5  1650
19  2019  1.56        32.9  1600
18  2018  1.62        32.5  1500
17  2017  1.65        31.9  1450
16  2016  1.66        31.4  1400
15  2015  1.64        30.9  1380
10  2010  1.53        28.5  1350

In [13]:
df['1500+'] = df.GDP>1500
df

     Yil  Temp  Aholi soni   GDP  1500+
21  2021  1.54        33.9  1700   True
20  2020  1.48        33.5  1650   True
19  2019  1.56        32.9  1600   True
18  2018  1.62        32.5  1500  False
17  2017  1.65        31.9  1450  False
16  2016  1.66        31.4  1400  False
15  2015  1.64        30.9  1380  False
10  2010  1.53        28.5  1350  False

In [14]:
del df['1500+']
df

     Yil  Temp  Aholi soni   GDP
21  2021  1.54        33.9  1700
20  2020  1.48        33.5  1650
19  2019  1.56        32.9  1600
18  2018  1.62        32.5  1500
17  2017  1.65        31.9  1450
16  2016  1.66        31.4  1400
15  2015  1.64        30.9  1380
10  2010  1.53        28.5  1350

## Lug ªatdan Datafreym yaratish

In [15]:
data = {
    'UZ': {2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9},
    'KZ': {2021:18.9, 2020:18.7, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8}
}
df2 = pd.DataFrame(data)
df2

        UZ    KZ
2021  33.9  18.9
2020  33.5  18.7
2019  32.9  18.5
2018  32.5  18.3
2017  31.9  18.1
2016   NaN  17.8

In [16]:
df2.index.name = 'Yil'

In [17]:
df2

        UZ    KZ
Yil
2021  33.9  18.9
2020  33.5  18.7
2019  32.9  18.5
2018  32.5  18.3
2017  31.9  18.1
2016   NaN  17.8

In [18]:
df2 = pd.DataFrame(data, index=[2021,2019,2017])
df2

        UZ    KZ
2021  33.9  18.9
2019  32.9  18.5
2017  31.9  18.1

In [19]:
df2.T

    2021  2019  2017
UZ  33.9  32.9  31.9
KZ  18.9  18.5  18.1

In [20]:
df2

        UZ    KZ
2021  33.9  18.9
2019  32.9  18.5
2017  31.9  18.1

In [21]:
df2.values

array([[33.9, 18.9],
       [32.9, 18.5],
       [31.9, 18.1]])

In [22]:
df

     Yil  Temp  Aholi soni   GDP
21  2021  1.54        33.9  1700
20  2020  1.48        33.5  1650
19  2019  1.56        32.9  1600
18  2018  1.62        32.5  1500
17  2017  1.65        31.9  1450
16  2016  1.66        31.4  1400
15  2015  1.64        30.9  1380
10  2010  1.53        28.5  1350

In [23]:
df.columns

Index(['Yil', 'Temp', 'Aholi soni', 'GDP'], dtype='object')

In [24]:
df.index

Index([21, 20, 19, 18, 17, 16, 15, 10], dtype='int64')

In [25]:
df2

        UZ    KZ
2021  33.9  18.9
2019  32.9  18.5
2017  31.9  18.1

In [26]:
'Tajikistan' in df2.columns

False

In [27]:
2021 in df2.index

True

In [28]:
df

     Yil  Temp  Aholi soni   GDP
21  2021  1.54        33.9  1700
20  2020  1.48        33.5  1650
19  2019  1.56        32.9  1600
18  2018  1.62        32.5  1500
17  2017  1.65        31.9  1450
16  2016  1.66        31.4  1400
15  2015  1.64        30.9  1380
10  2010  1.53        28.5  1350

In [29]:
matrix = np.zeros((3, 3))

for i in range(3):
    matrix[i] = i
matrix

array([[0., 0., 0.],
       [1., 1., 1.],
       [2., 2., 2.]])

In [30]:
df.index.difference(df2.index)

Index([10, 15, 16, 17, 18, 19, 20, 21], dtype='int64')

In [31]:
df.index.union(df2.index)

Index([10, 15, 16, 17, 18, 19, 20, 21, 2017, 2019, 2021], dtype='int64')

In [32]:
# read index metodlari

In [33]:
df

     Yil  Temp  Aholi soni   GDP
21  2021  1.54        33.9  1700
20  2020  1.48        33.5  1650
19  2019  1.56        32.9  1600
18  2018  1.62        32.5  1500
17  2017  1.65        31.9  1450
16  2016  1.66        31.4  1400
15  2015  1.64        30.9  1380
10  2010  1.53        28.5  1350

In [34]:
data = {
    'Yil':        [2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
    'Aholi soni': [33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5], 
    'Temp':       [1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53],
    'Zichlik':    [79.77, 78.68, 77.53, 76.34, 75.15, 73.91, 72.71, 67.03]
}

In [35]:
df = pd.DataFrame(data)
df

    Yil  Aholi soni  Temp  Zichlik
0  2021        33.9  1.54    79.77
1  2020        33.5  1.48    78.68
2  2019        32.9  1.56    77.53
3  2018        32.5  1.62    76.34
4  2017        31.9  1.65    75.15
5  2016        31.4  1.66    73.91
6  2015        30.9  1.64    72.71
7  2010        28.5  1.53    67.03

In [36]:
# index qiymatini o'gartirish
df.index = [21,20,19,18,17,16,15,10]
df

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.68
19  2019        32.9  1.56    77.53
18  2018        32.5  1.62    76.34
17  2017        31.9  1.65    75.15
16  2016        31.4  1.66    73.91
15  2015        30.9  1.64    72.71
10  2010        28.5  1.53    67.03

In [37]:
# index yordamida tartibni o'zgartirish
# Reindex
ind = [21,20,19,18,17,16,15,10]
ind.sort()
ind

[10, 15, 16, 17, 18, 19, 20, 21]

In [38]:
df.reindex(ind)

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [39]:
df = df.reindex(ind)
df

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [40]:
# saqlab qoladigan index qoladi
df.reindex([10,15,20])

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
20  2020        33.5  1.48    78.68

In [41]:
df.reindex(index=range(10,22), method='nearest') #bu noto'g'ri

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
11  2010        28.5  1.53    67.03
12  2010        28.5  1.53    67.03
13  2015        30.9  1.64    72.71
14  2015        30.9  1.64    72.71
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [42]:
df.reindex(index=range(10,22), method='ffill')

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
11  2010        28.5  1.53    67.03
12  2010        28.5  1.53    67.03
13  2010        28.5  1.53    67.03
14  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [43]:
df.reindex(columns=['Aholi soni', 'Temp', 'Zichlik'])

    Aholi soni  Temp  Zichlik
10        28.5  1.53    67.03
15        30.9  1.64    72.71
16        31.4  1.66    73.91
17        31.9  1.65    75.15
18        32.5  1.62    76.34
19        32.9  1.56    77.53
20        33.5  1.48    78.68
21        33.9  1.54    79.77

In [44]:
df.loc[[10, 15,18, 20], ['Aholi soni', 'Temp', 'Zichlik']]

    Aholi soni  Temp  Zichlik
10        28.5  1.53    67.03
15        30.9  1.64    72.71
18        32.5  1.62    76.34
20        33.5  1.48    78.68

## Qator va ustunlarni tashlab yuborish

In [45]:
df2 = df.drop(10)
df2

     Yil  Aholi soni  Temp  Zichlik
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [46]:
df.drop([10, 20])

     Yil  Aholi soni  Temp  Zichlik
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
21  2021        33.9  1.54    79.77

In [47]:
df.drop('Yil', axis=1)

    Aholi soni  Temp  Zichlik
10        28.5  1.53    67.03
15        30.9  1.64    72.71
16        31.4  1.66    73.91
17        31.9  1.65    75.15
18        32.5  1.62    76.34
19        32.9  1.56    77.53
20        33.5  1.48    78.68
21        33.9  1.54    79.77

In [48]:
df

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [49]:
type(df)

pandas.core.frame.DataFrame

In [50]:
# Series ko'rinishida olish
data = df['Aholi soni']
data

10    28.5
15    30.9
16    31.4
17    31.9
18    32.5
19    32.9
20    33.5
21    33.9
Name: Aholi soni, dtype: float64

In [51]:
type(data)

pandas.core.series.Series

In [52]:
# DF ko'rinishida olish 2 ta qavs 
data = df[['Aholi soni']]
data
type(data)

pandas.core.frame.DataFrame

In [53]:
data

    Aholi soni
10        28.5
15        30.9
16        31.4
17        31.9
18        32.5
19        32.9
20        33.5
21        33.9

In [54]:
data[[21]]

KeyError: "None of [Index([21], dtype='int32')] are in the [columns]"

In [ ]:
data[0:4]

In [ ]:
data[[10,15,16,17]] # index bn chaqirganda 2 ta qavs

In [ ]:
obj = pd.Series(np.arange(8.), index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
obj

In [ ]:
obj['a']

In [ ]:
obj['c':'h']

In [ ]:
obj[0:4]

In [ ]:
obj['a':'c'] = 15
obj

In [ ]:
# Filtrlash
obj[obj<15]

## Elementlarni tanlash. Datafreym

In [ ]:
uz = {2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9, 2016:31.4, 2015:30.9}
kz = {2020:18.8, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8, 2015:17.6}
tj = {2020:9.5,  2019:9.3,  2018:9.1,  2017:8.9,  2016:8.7,  2015:8.5}
kg = {2020:5.5,  2019:6.4,  2018:6.3,  2017:6.2,  2016:6.1,  2015:6}
tr = {2020:6.0,  2019:5.9,  2018:5.9,  2017:5.8,  2016:5.6,  2015:5.6}

df = pd.DataFrame(
    {'Uzbekistan': uz, 
     'Kazakhstan': kz,
     'Tajikistan': tj,
     'Kyrgistan' : kg,
     'Turkmenistan' : tr
    }
)

In [ ]:
df

In [ ]:
df['Uzbekistan']

In [ ]:
df[['Uzbekistan']]

In [ ]:
#Numpy arrayga aylantirish
df['Uzbekistan'].to_numpy()

In [ ]:
df>10

In [ ]:
df[['Uzbekistan']] [df['Uzbekistan']>32]

In [ ]:
df2 = df.T
df2

In [ ]:
df2[df2[2015]>6]

## .loc/iloc va .at/.iat

In [ ]:
df

In [ ]:
df.loc[[2017]]

In [ ]:
df.loc[[2015, 2020], ['Uzbekistan', 'Tajikistan']]

In [ ]:
df.iloc[[0,4]]

In [ ]:
df.iloc[[0,4], [0,3]]

In [ ]:
df.at[2015, 'Tajikistan']

In [ ]:
df.at[2020, 'Tajikistan']

In [ ]:
df.iat[2,1]

In [55]:
df

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

## Arifmetik amallar

In [60]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [61]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [62]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [63]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [64]:
df1 = pd.DataFrame(np.arange(9.).reshape(3, 3), columns=list('bcd'), index=['Olma', 'Anor', 'Uzum'])
df2 = pd.DataFrame(np.arange(12.).reshape(4, 3), columns=list('abc'), index=['Olma', 'Anor', 'Qovun', 'Anjir'])

In [65]:
df1

        b    c    d
Olma  0.0  1.0  2.0
Anor  3.0  4.0  5.0
Uzum  6.0  7.0  8.0

In [66]:
df2

         a     b     c
Olma   0.0   1.0   2.0
Anor   3.0   4.0   5.0
Qovun  6.0   7.0   8.0
Anjir  9.0  10.0  11.0

In [67]:
df1+df2

        a    b    c   d
Anjir NaN  NaN  NaN NaN
Anor  NaN  7.0  9.0 NaN
Olma  NaN  1.0  3.0 NaN
Qovun NaN  NaN  NaN NaN
Uzum  NaN  NaN  NaN NaN

In [69]:
df1.add(df2, fill_value=0) # qo'shish radd

         a     b     c    d
Anjir  9.0  10.0  11.0  NaN
Anor   3.0   7.0   9.0  5.0
Olma   0.0   1.0   3.0  2.0
Qovun  6.0   7.0   8.0  NaN
Uzum   NaN   6.0   7.0  8.0

In [70]:
df2.sub(df1, fill_value=0) # ayirish rsub

         a     b     c    d
Anjir  9.0  10.0  11.0  NaN
Anor   3.0   1.0   1.0 -5.0
Olma   0.0   1.0   1.0 -2.0
Qovun  6.0   7.0   8.0  NaN
Uzum   NaN  -6.0  -7.0 -8.0

In [80]:
df2.div(df1) # bo'lish - rdiv

        a         b     c   d
Anjir NaN       NaN   NaN NaN
Anor  NaN  1.333333  1.25 NaN
Olma  NaN       inf  2.00 NaN
Qovun NaN       NaN   NaN NaN
Uzum  NaN       NaN   NaN NaN

In [72]:
df = pd.DataFrame(np.arange(1,13.).reshape(3,4), index=list('abc'), columns=['Olma','Anor','Qovun','Anjir'])
obj = pd.Series([1,1,2,2], index=df.columns)

In [73]:
df

   Olma  Anor  Qovun  Anjir
a   1.0   2.0    3.0    4.0
b   5.0   6.0    7.0    8.0
c   9.0  10.0   11.0   12.0

In [76]:
obj

Olma     1
Anor     1
Qovun    2
Anjir    2
dtype: int64

In [77]:
df+obj

   Olma  Anor  Qovun  Anjir
a   2.0   3.0    5.0    6.0
b   6.0   7.0    9.0   10.0
c  10.0  11.0   13.0   14.0

In [78]:
obj = pd.Series([2,3,1], index=['Olma','Uzum','Qovun'])

In [79]:
df+obj

   Anjir  Anor  Olma  Qovun  Uzum
a    NaN   NaN   3.0    4.0   NaN
b    NaN   NaN   7.0    8.0   NaN
c    NaN   NaN  11.0   12.0   NaN

In [81]:
df.sub(obj)

   Anjir  Anor  Olma  Qovun  Uzum
a    NaN   NaN  -1.0    2.0   NaN
b    NaN   NaN   3.0    6.0   NaN
c    NaN   NaN   7.0   10.0   NaN

## Funksiyalarni qo ªllash

In [82]:
df = pd.DataFrame(np.random.randn(3,4), index=list('abc'), columns=['Olma','Anor','Qovun','Anjir'])
df

       Olma      Anor     Qovun     Anjir
a -0.380338  0.269882 -0.482269 -0.396170
b  0.603200  0.419956 -0.447153  0.658678
c  2.015156 -0.513499 -0.149345  0.502079

In [83]:
np.abs(df) # ishorani o'zgartirish

       Olma      Anor     Qovun     Anjir
a  0.380338  0.269882  0.482269  0.396170
b  0.603200  0.419956  0.447153  0.658678
c  2.015156  0.513499  0.149345  0.502079

In [85]:
np.round(df) # butunlash

   Olma  Anor  Qovun  Anjir
a  -0.0   0.0   -0.0   -0.0
b   1.0   0.0   -0.0    1.0
c   2.0  -1.0   -0.0    1.0

In [87]:
df.mean()

Olma     0.746006
Anor     0.058780
Qovun   -0.359589
Anjir    0.254862
dtype: float64

In [88]:
df.mean(axis=1)

a   -0.247224
b    0.308670
c    0.463598
dtype: float64

In [90]:
df.apply(abs)

       Olma      Anor     Qovun     Anjir
a  0.380338  0.269882  0.482269  0.396170
b  0.603200  0.419956  0.447153  0.658678
c  2.015156  0.513499  0.149345  0.502079

In [93]:
df.apply(sum, axis=1)

a   -0.988896
b    1.234681
c    1.854391
dtype: float64

In [97]:
f =lambda x: x.max() - x.min() # funksiya yasab

In [98]:
df.apply(f)  # apply ga berish mimkin

Olma     2.395494
Anor     0.933454
Qovun    0.332925
Anjir    1.054848
dtype: float64

In [100]:
def foo(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [101]:
df.apply(foo)

         Olma      Anor     Qovun     Anjir
min -0.380338 -0.513499 -0.482269 -0.396170
max  2.015156  0.419956 -0.149345  0.658678

In [102]:
df.applymap(lambda x: x*x)

C:\Users\User\AppData\Local\Temp\ipykernel_25596\3316139181.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x*x)

       Olma      Anor     Qovun     Anjir
a  0.144657  0.072836  0.232584  0.156951
b  0.363850  0.176363  0.199946  0.433856
c  4.060853  0.263681  0.022304  0.252083

In [103]:
df

       Olma      Anor     Qovun     Anjir
a -0.380338  0.269882 -0.482269 -0.396170
b  0.603200  0.419956 -0.447153  0.658678
c  2.015156 -0.513499 -0.149345  0.502079

## df va Series obektalarini Tartiblash

In [109]:
#obj = pd.Series(range(4), index = ['d', 'a', 'b', 'c'])
obj = pd.Series(range(4), index = list('dabc'))
obj

d    0
a    1
b    2
c    3
dtype: int64

In [110]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [111]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [112]:
df = pd.read_csv('https://raw.githubusercontent.com/anvarnarz/praktikum_datasets/main/usa_cars.csv', index_col=0)
df.head()

,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,6300,toyota,cruiser,2008,clean vehicle,274117,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,2899,ford,se,2011,clean vehicle,190552,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,5350,dodge,mpv,2018,clean vehicle,39590,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,25000,ford,door,2014,clean vehicle,64146,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,27700,chevrolet,1500,2018,clean vehicle,6654,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left

In [114]:
df.shape

(2499, 12)

In [120]:
df['title_status'].value_counts()

title_status
clean vehicle        2336
salvage insurance     163
Name: count, dtype: int64

In [123]:
df.sort_index(axis=1, inplace=True) # Ustunlar bo'yicha tartiblash

In [124]:
df

,brand,color,condition,country,lot,mileage,model,price,state,title_status,vin,year
0,toyota,black,10 days left,usa,159348797,274117,cruiser,6300,new jersey,clean vehicle,jtezu11f88k007763,2008
1,ford,silver,6 days left,usa,166951262,190552,se,2899,tennessee,clean vehicle,2fmdk3gc4bbb02217,2011
2,dodge,silver,2 days left,usa,167655728,39590,mpv,5350,georgia,clean vehicle,3c4pdcgg5jt346413,2018
3,ford,blue,22 hours left,usa,167753855,64146,door,25000,virginia,clean vehicle,1ftfw1et4efc23745,2014
4,chevrolet,red,22 hours left,usa,167763266,6654,1500,27700,florida,clean vehicle,3gcpcrec2jg473991,2018
...,...,...,...,...,...,...,...,...,...,...,...,...
2494,nissan,red,1 days left,usa,167722715,23609,versa,7800,california,clean vehicle,3n1cn7ap9kl880319,2019
2495,nissan,silver,21 hours left,usa,167762225,34553,versa,9200,florida,clean vehicle,3n1cn7ap5jl884088,2018
2496,nissan,silver,21 hours left,usa,167762226,31594,versa,9200,florida,clean vehicle,3n1cn7ap9jl884191,2018
2497,nissan,black,2 days left,usa,167762227,32557,versa,9200,florida,clean vehicle,3n1cn7ap3jl883263,2018
2498,nissan,silver,21 hours left,usa,167762228,31371,versa,9200,florida,clean vehicle,3n1cn7ap4jl884311,2018

In [126]:
df.sort_index(ascending=False) # Teskari tartiblash

,brand,color,condition,country,lot,mileage,model,price,state,title_status,vin,year
2498,nissan,silver,21 hours left,usa,167762228,31371,versa,9200,florida,clean vehicle,3n1cn7ap4jl884311,2018
2497,nissan,black,2 days left,usa,167762227,32557,versa,9200,florida,clean vehicle,3n1cn7ap3jl883263,2018
2496,nissan,silver,21 hours left,usa,167762226,31594,versa,9200,florida,clean vehicle,3n1cn7ap9jl884191,2018
2495,nissan,silver,21 hours left,usa,167762225,34553,versa,9200,florida,clean vehicle,3n1cn7ap5jl884088,2018
2494,nissan,red,1 days left,usa,167722715,23609,versa,7800,california,clean vehicle,3n1cn7ap9kl880319,2019
...,...,...,...,...,...,...,...,...,...,...,...,...
4,chevrolet,red,22 hours left,usa,167763266,6654,1500,27700,florida,clean vehicle,3gcpcrec2jg473991,2018
3,ford,blue,22 hours left,usa,167753855,64146,door,25000,virginia,clean vehicle,1ftfw1et4efc23745,2014
2,dodge,silver,2 days left,usa,167655728,39590,mpv,5350,georgia,clean vehicle,3c4pdcgg5jt346413,2018
1,ford,silver,6 days left,usa,166951262,190552,se,2899,tennessee,clean vehicle,2fmdk3gc4bbb02217,2011
0,toyota,black,10 days left,usa,159348797,274117,cruiser,6300,new jersey,clean vehicle,jtezu11f88k007763,2008

In [127]:
df.sort_index(ascending=False, axis=1)

,year,vin,title_status,state,price,model,mileage,lot,country,condition,color,brand
0,2008,jtezu11f88k007763,clean vehicle,new jersey,6300,cruiser,274117,159348797,usa,10 days left,black,toyota
1,2011,2fmdk3gc4bbb02217,clean vehicle,tennessee,2899,se,190552,166951262,usa,6 days left,silver,ford
2,2018,3c4pdcgg5jt346413,clean vehicle,georgia,5350,mpv,39590,167655728,usa,2 days left,silver,dodge
3,2014,1ftfw1et4efc23745,clean vehicle,virginia,25000,door,64146,167753855,usa,22 hours left,blue,ford
4,2018,3gcpcrec2jg473991,clean vehicle,florida,27700,1500,6654,167763266,usa,22 hours left,red,chevrolet
...,...,...,...,...,...,...,...,...,...,...,...,...
2494,2019,3n1cn7ap9kl880319,clean vehicle,california,7800,versa,23609,167722715,usa,1 days left,red,nissan
2495,2018,3n1cn7ap5jl884088,clean vehicle,florida,9200,versa,34553,167762225,usa,21 hours left,silver,nissan
2496,2018,3n1cn7ap9jl884191,clean vehicle,florida,9200,versa,31594,167762226,usa,21 hours left,silver,nissan
2497,2018,3n1cn7ap3jl883263,clean vehicle,florida,9200,versa,32557,167762227,usa,2 days left,black,nissan
2498,2018,3n1cn7ap4jl884311,clean vehicle,florida,9200,versa,31371,167762228,usa,21 hours left,silver,nissan

In [130]:
df.sort_values(by='price', ascending=False)

,brand,color,condition,country,lot,mileage,model,price,state,title_status,vin,year
502,mercedes-benz,silver,2 days left,usa,167607883,25302,sl-class,84900,florida,clean vehicle,wddjk7ea3hf044968,2017
1340,ford,no_color,2 days left,usa,167780682,10536,drw,74000,illinois,clean vehicle,1ft8w4dt6ked32656,2019
1336,ford,no_color,2 days left,usa,167780680,9643,drw,70000,illinois,clean vehicle,1ft8w3dt3kee48276,2019
277,dodge,blue,21 hours left,usa,167759490,10944,challenger,67000,ohio,clean vehicle,2c3cdzl97kh518237,2019
1215,ford,black,21 hours left,usa,167718954,6500,srw,65500,indiana,clean vehicle,1ft7w2bt0kec44818,2019
...,...,...,...,...,...,...,...,...,...,...,...,...
141,dodge,orange,2 days left,usa,167756157,177948,van,0,utah,salvage insurance,2d8hn44h88r669549,2008
391,cadillac,white,9 days left,usa,167651218,105169,coupe,0,virginia,salvage insurance,1g6el12y9yu148063,2000
285,ford,black,17 hours left,usa,167251902,124969,door,0,oklahoma,salvage insurance,1fafp34p7yw270338,2000
290,mazda,gray,16 hours left,usa,167543177,117541,door,0,indiana,salvage insurance,jm3er293590215768,2009
354,ford,blue,2 days left,usa,167360535,180364,pickup,0,tennessee,salvage insurance,1ftyr10d19pa60391,2009

In [132]:
df.sort_values(by=['price', 'mileage'], ascending=False)

,brand,color,condition,country,lot,mileage,model,price,state,title_status,vin,year
502,mercedes-benz,silver,2 days left,usa,167607883,25302,sl-class,84900,florida,clean vehicle,wddjk7ea3hf044968,2017
1340,ford,no_color,2 days left,usa,167780682,10536,drw,74000,illinois,clean vehicle,1ft8w4dt6ked32656,2019
1336,ford,no_color,2 days left,usa,167780680,9643,drw,70000,illinois,clean vehicle,1ft8w3dt3kee48276,2019
277,dodge,blue,21 hours left,usa,167759490,10944,challenger,67000,ohio,clean vehicle,2c3cdzl97kh518237,2019
1215,ford,black,21 hours left,usa,167718954,6500,srw,65500,indiana,clean vehicle,1ft7w2bt0kec44818,2019
...,...,...,...,...,...,...,...,...,...,...,...,...
196,ford,white,2 days left,usa,167656523,76858,mpv,0,texas,clean vehicle,1fbax2cv0hkb32599,2017
349,heartland,white,7 days left,usa,167266321,1,sundance,0,pennsylvania,clean vehicle,5sfgf29269e031344,2009
309,chevrolet,maroon,18 hours left,usa,167418651,0,door,0,wyoming,salvage insurance,3gnek12t74g240524,2004
322,ford,green,19 hours left,usa,167359174,0,chassis,0,california,salvage insurance,1fdee14n7rha47894,1994
545,gmc,light blue,18 hours left,usa,167358601,0,door,0,colorado,salvage insurance,1gkfk16k5pj701631,1993